{"cenaAtual":7,"inventario":["faca","dicionario","isqueiro","flauta","pergaminho"],"cenas":[{"id":0,"title":"cena inicial","description":"\n\tEm sua expedição pelo Egito, o arqueólogo prof Jones, sem querer, caiu dentro de uma antiga tumba do faraó. Por ser arqueólogo, ele sabe que a única saída desta tumba é por cima. Então prof Jones terá que descobrir, dentre as várias caminhos da pirâmide, qual deles o levarão a saída. Por esquecer sua mochila no acampamento, prof Jones tem apenas em seus bolsos um ISQUEIRO, uma FACA, e um DICIONÁRIO de Egipcio/Portugues.\n\tO clima está frio e prof Jones está assustado, pois sabe que nesta pirâmide se encontra uma múmia real enterrada em alguma tumba. Observando ao redor, prof Jones consegue enxergar uma TOCHA, porém ela está apagada. Com muita sorte, apesar de estar trancado na pirâmide, prof Jones caiu em cima de uma barra de OURO. Na sala da pirâmide onde prof Jones está caído está muito Escuro, porém prof Jones consegue enxergar 2 saidas: a SAIDA1 ou SAIDA2","object":["tocha","ouro","mim"],"action":[],"resolved":[true,true,false],"exit":[1,2,9]},{"id":1,"title":"cena 1","description":"\n\tAo chegar nesta sala, prof Jones se deparou duas portas com duas placas com grafias em Egipcio. Em cima da SAIDA1 esta escrito na PLACA1 MIUR UED, e em cima da SAIDA2 na PLACA2 esta escrito SAOB ED.","object":["placa1","placa2"],"action":[],"resolved":[true,true,false],"exit":[2,3]},{"id":2,"title":"cena 2","description":"\n\tAo entrar nesta sala, prof Jones percebe uma descida no piso. Pouco após, ele ouve um leve barulho. Então um barulho maior. Prof Jones olha para baixo e percebe que ele pisou em um bloco que provavelmente é uma armadilha. Ao tirar o pé do bloco, o corredor a sua frente é inundado por uma chuva de flechas de parede a parede. Prof Jones sabe que tem que prosseguir, então ele lembra que há apenas um jeito de passar pelo corredor e conseguir sobrevive: RASTEJAR, CORRER, IR_PULANDO, ou GRITAR_ALTO.","object":[],"resolved":[false,false,false],"exit":[3]},{"id":3,"title":"cena 3","description":"\n\tDepois de tanto andar, prof Jones chega em mais uma camara. Nesta, ele observa caida no chao uma FLAUTA. Um pouco a frente, em cima de uma coluna de pedra, ele vê um JARRO de barro vazio, um pouco pesado. Logo a frente, ele vê uma saida, o SAIDA1","object":["flauta","jarro"],"action":[],"resolved":[true,false,false],"exit":[5,4]},{"id":4,"title":"cena 4","description":"\n\tApós entrar na passagem secreta, ele descobre que não consegue enchergar quase nada, apenas uma ALAVANCA que reflete o pouco de luz que esta entrando no ambiente","object":["alavanca"],"action":[],"resolved":[false,false,false],"exit":[5]},{"id":5,"title":"cena 5","description":"\n\tAo entrar na camera ele se depara com o SARCOFAGO do faraó Anubiks. Na lateral do Sarcófago, há uma RUBRICA grafada em Egípcio. A tampa do SARCOFAGO parece esta entre aberta com uma luz violeta que esta saindo de dentro. Provavelmente da para abrir.","object":["sarcofago","ruby","rubrica"],"action":[],"resolved":[true,false,false],"exit":[6]},{"id":6,"title":"cena 6","description":"\n\tAo entrar nesta nova camera ele percebe logo de cara, que no centro do ambiente se encontra um PERGAMINHO dourado relusente em cima de um pedestal e logo atraz uma SAIDA para aquela sala","object":["pergaminho","cobra"],"action":[],"resolved":[true,false,false],"exit":[7]},{"id":7,"title":"cena 7","description":"\n\tDepois de tamtas desventuras que encontrou durante o caminho, o aqueologo prof Jones se depara com a SAIDA, mas antes de dar os primeiro passos para sua liberdade e ouve um ruivo de raiva logo atras dele, uma MUMIA aparece furiosa atras dele e vem em sua direção, ele pensa sen tem alguma coisa no inventario que ele possa utilizar","object":["mumia"],"action":[],"resolved":[false,false,false],"exit":[8]},{"id":8,"title":"cena 8","description":"\n\tApos finalmente sair da tumba, ele se depara com ladroes de tumbas nazistas, onde o arqueologo é capturado e amarrado em cima do prota-mala, sera que nosso Heroi vai escapar de mais uma enrascada","object":[],"action":[],"resolved":[false,false,false],"exit":[]},{"id":9,"title":"cena 9","description":"Após entrar descobrir um novo corredor, prof Jones ouve um barulho gigantesco e percebe que uma bola de pedra macissa esta vindo em sua direção, sorte que ele lembra que so tem um jeito de escapar deste tipo de armadilha","object":[],"action":[],"resolved":[false],"exit":[7]}],"objetos":[{"id":0,"name":"isqueiro","description":"ISQUEIRO de prata, serve para acender as coisas.","txtPositivo":["A tocha acendeu o ambiente revelando a SAIDA3. Porém este caminho parece uma armadilha."],"txtDead":["Voçe, desesperadamente, foi muito burro e colocou fogo em voce mesmo."],"commandCorrect":["use isqueiro with tocha"],"commandDead":["use isqueiro with mim"],"targetScene":0,"resorved":0,"got":1},{"id":1,"name":"faca","description":"FACA de ossos em forma de caveira muito afiada","txtPositivo":[],"txtDead":["Voce matou uma cobra, mas foi picado por outras 100 cobras","Nao se pode matar algo que ja esta morto. Ela apenas quebrou seu pescoço"],"commandCorrect":[],"commandDead":["use faca with cobra","use faca with mumia"],"targetScene":0,"resorved":0,"got":1},{"id":2,"name":"dicionario","description":"Serve para traduzir do Egipcio para o Portugues","txtPositivo":["tradução = Perigo","tradução = Sem Perigo ","RUBRICA: aquele da qual me acordar, minha furia sofrerá"],"txtDead":[],"commandCorrect":["use dicionario with placa1","use dicionario with placa2","use dicionario with rubrica"],"commandDead":[],"targetScene":0,"resorved":0,"got":1},{"id":3,"name":"ouro","description":"Serve como oferenda ou como um objeto de valor","txtPositivo":[],"txtDead":[],"commandCorrect":["use ouro with botao"],"commandDead":[],"targetScene":0,"resorved":0,"got":0},{"id":4,"name":"jarro","description":"Um JARRO antigo para pegar água","txtPositivo":["Ao pegar o JARRO a parede atras do prof Jones mostra um caminho antes escondido a SAIDA2"],"txtDead":[],"commandCorrect":["get jarro"],"commandDead":[],"targetScene":0,"resorved":0,"got":0},{"id":5,"name":"flauta","description":"FLAUTA de osso entalhada para se parecer com uma SERPENTE","txtPositivo":["as COBRAS ficaram ipnotizadas pelo som. Entao prof Jones pode ir para a SAIDA"],"txtDead":[],"commandCorrect":["use flauta with cobra"],"commandDead":[],"targetScene":0,"resorved":0,"got":0},{"id":6,"name":"alavanca","description":"Nem tudo o que reluz eh ouro","txtPositivo":[],"textDead":["Um alçapão se abriu, fazendo voce cair num monte de espinhos. VOCE MORREU."],"commandCorrect":[],"commandDead":["use alavanca"],"targetScene":0,"resorved":0,"got":-1},{"id":8,"name":"sarcofago","description":"Sarcofago de ouro de um grande Faraó. Parace estar meio ABERTO","txtPositivo":["Voce encontrou um enorme RUBY dentro do sarcofago. Também, a SAIDA."],"txtDead":[],"commandCorrect":["open sarcofago"],"commandDead":[],"targetScene":0,"resorved":0,"got":-1},{"id":9,"name":"tocha","description":"Tocha serve para onde esta escuro","txtPositivo":["Voce descobriu uma nova SAIDA"],"txtDead":[],"commandCorrect":["use tocha"],"commandDead":[],"targetScene":0,"resorved":0,"got":0},{"id":10,"name":"pergaminho","description":"PERGAMINHO dourado, muito bonito para estar desprotegido","txtPositivo":["O pergaminho era uma armadilha. Entao muitas cobras cairam sobre voce. Entao voce lembra que pode fazer algumas coisas: CORRER, tocar a FLAUTA, usar a FACA ou GRITAR"],"txtDead":[],"commandCorrect":["get pergaminho"],"commandDead":[],"targetScene":0,"resorved":0,"got":1},{"id":11,"name":"ruby","description":"Gema de RUBY gigante","txtPositivo":["A mumia ficou satisfeita, e voltou para tirar mais uma soneca"],"txtNegative":"","commandCorrect":["use ruby with mumia"],"commandDead":[],"targetScene":0,"resorved":0,"got":0}],"cenasJogo":["Item ja esta no Inventario","Não foi uma boa ideia, elas te picaram até a morte\n","A pedra esmagou o prof Jones\n","As serpentes ficaram atordoadas com o barulho, fazendo assim que prof Jones pudesse ir saida","prof Jones escapou por pouco","A mumia te viu e te matou","A mumia te viu mas não deu bola e saiu por onde entrou","prof Jones escapou por pouco","e conseguiu encontrar a saida do tunel","Nunca que isso ia funcionar."]}