{
    "scene" : [
 
        {   "id": 0,
            "title": "Cena Principal",
            "description": "EM sua expedição pelo Egito, o arqueólogo MENSAH, sem querer, caiu dentro de uma antiga tumba do faraó. Por ser arqueólogo, ele sabe que a única saída desta tumba é por cima. Então Mensah terá que descobrir, dentre as várias passagens da pirâmide, qual deles dão na saída. Por esquecer sua mochila no acampamento, Mensah tem apenas em seus bolsos um ISQUEIRO, uma FACA, e um DICIONÁRIO Egito/Brasil.",
            "object": []
        },
 
        {   "id": 1,
            "title": "Cena Inicial",
            "description": "O clima está frio e Mensah está assustado, pois sabe que nesta pirâmide se encontra uma múmia real enterrada em seus caminhos. Observando ao redor, MENSAH consegue enxergar uma TOCHA, porém ela está apagada. Com muita sorte, apesar de estar trancado na pirâmide, MENSAH caiu em cima de uma BARRO_DE_OURO. Na sala da pirâmide onde MENSAH está caído está muito ESCuro, porém MENSAH consegue enxergar duas saídas: CAMINHO 1, CAMINHO 2",
            "object": []
        },
 
        {   "id": 3,
            "title": "Corredor das flexas",
            "description": "Ao entrar nesta sala, Mensah percebe uma descida no piso. Pouco após, ele ouve um leve barulho. Então um barulho maior. Mensah olha para baixo e percebe que ele pisou em um bloco que provavelmente é uma armadilha. Ao tirar o pé do bloco, o corredor a sua frente é inundado por uma chuva de flechas de parede a parede. Mensah sabe que tem que prosseguir, então ele lembra que há apenas um jeito de passar pelo corredor e conseguir sobreviver: RASTEJAR, CORRER, IR_PULANDO, ou GRITAR_AUTO.",
            "object": []
        },
 
        {   "id": 4,
            "title": "Corredor das flexas",
            "description": "Ao entrar nesta sala, Mensah percebe uma descida no piso. Pouco após, ele ouve um leve barulho. Então um barulho maior. Mensah olha para baixo e percebe que ele pisou em um bloco que provavelmente é uma armadilha. Ao tirar o pé do bloco, o corredor a sua frente é inundado por uma chuva de flechas de parede a parede. Mensah sabe que tem que prosseguir, então ele lembra que há apenas um jeito de passar pelo corredor e conseguir sobreviver: RASTEJAR, CORRER, IR_PULANDO, ou GRITAR_AUTO.",
            "object": []
        }
    ]
 }
 